# выводит каждый символ из строки
# for i in 'Hello':
#     print(i + '!')

# выводит количество девочек в списке и их имена
# girls = ['Alice', 'Bertha', 'Clara']
# print('В списке ' + str(len(girls)) + ' девочек')
      
# for girl in girls:
#     print(girl)

# выводит количество мальчиков в списке и их имена
# boys = ['Alex', 'Bob', 'Charlie']
# boys_length = len(boys)
# i = 0
# print('Длина списка: ', boys_length)
# while i < boys_length:
#     print('i =', i)
#     print(boys[i]) 
#     i += 1
#     print('----')
# print('Цикл завершен')

# is_true = True
# i = 0
# while is_true:
#     print(i)
#     if i == 10:
#         is_true = False
#     i += 1

# прибавление
# number_1 = 10
# print(number_1)
# number_1 = number_1 + 10
# print(number_1)
# number_1 += 10
# print(number_1)

# создание списка из range
# range_list = list(range(1, 10))
# print(range_list)

# for number in range(0, 10):
#     print(number)
# print(number)

# while
# i = 1
# while i <= 5:
#     print(i)
#     i += 1


# Вывести числа от 1 до (запросить у пользователя)
# вывести четные числа от 1 до (запросить у пользователя)
# вывести нечетные числа от 1 до (запросить у пользователя)
# вывести числа от 1 до 100 в обратном порядке

# for i in range(1, n):
#     print(i)

# 1
# n = int(input('Введите число: '))
# i = 1
# while i <= n:
#     print(i)
#     i += 1

# # 2
# n = int(input('Введите число: '))
# i = 1
# while i <= n:
#     print('i =', i)
#     if i % 2 == 0:
#         print(i)
#     i += 1


# # 3
# n = int(input('Введите число: '))
# i = 1
# while i <= n:
#     print('i =', i)
#     if i % 2 != 0:
#         print(i)
#     i += 1

# 4
# i = 100
# while i >= 1:
#     print(i)
#     i -= 1

